---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalResourceType
source: html/61bbe93c-659a-1bd3-e285-746ce3cdb7d6.htm
---
# ExternalResourceType Methods

Compares two Guid-based enum object based on their concrete class and GUID value.